app/controllers/comments_controller.rb

  def new
    @user = current_user(params[:user_id])
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @user = current_user(params[:user_id])
    @post = Post.find(params[:post_id])
    @comment = Comment.new(
      author: @user,
      post: @post,
      text: params[:comment][:text]
    )
    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Nice work done by you"], ["created_at", "2023-04-08 08:24:56.439953"], ["updated_at", "2023-04-08 08:24:56.439953"], ["author_id", 2], ["post_id", 4]]