app/controllers/likes_controller.rb

    def create
      @post = Post.find(params[:post_id])
      @user = current_user(params[:user_id])
      @like = Like.new(author: @user, post: @post)
      @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2023-04-08 08:30:21.718202"], ["updated_at", "2023-04-08 08:30:21.718202"], ["author_id", 2], ["post_id", 5]]