app/controllers/posts_controller.rb

  def index
    @user = User.includes(:posts).find(params[:user_id])
    @post = Post.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"

  def show
    @user = User.find(params[:user_id])
    @post = Post.includes(:comments).find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = current_user
    @post = Post.create(
      author: @user,
      title: params[:post][:title],
      text: params[:post][:text]
    )
    if @post.save
---
INSERT INTO "posts" ("title", "text", "likescounter", "created_at", "updated_at", "author_id", "commentscounter") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"