app/models/comment.rb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
UPDATE "posts" SET "updated_at" = $1, "commentscounter" = $2 WHERE "posts"."id" = $3  [["updated_at", "2023-04-08 08:24:56.475392"], ["commentscounter", 1], ["id", 1]]
---
  def update_the_comment_counter
    Post.update(commentscounter: post.comments.count)