app/models/like.rb

  def update_post_likes_counter
    post.update(likescounter: Like.where(post_id: post.id).count)
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 5]]
UPDATE "posts" SET "likescounter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likescounter", 1], ["updated_at", "2023-04-08 08:30:21.752486"], ["id", 5]]