app/models/post.rb

  def update_author_posts_counter
    author.update(postscounter: Post.where(author_id: author.id).count)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]